[Samurai X2SoldierClassTemplate]
+DisplayName="<font color='#ffffff'>武侍</font>"
+ClassSummary="武士之道向死而生，每日皆以必死之心，沉入冥想之境。于冥想之中，心如止水，然须假想万般苦难，如剑矛撕裂、枪箭贯体、海浪淹没、烈火焚身、五雷轰顶、地震掩埋、悬崖坠亡、苦疾缠身，乃至主人辞世，切腹以随。此皆无间地狱之景象，日复一日，体悟死亡之轮回。如此，方为真正的武侍之道。"
+LeftAbilityTreeTitle="剑圣"
+RightAbilityTreeTitle="浪人"
AbilityTreeTitles[0]="剑圣"
AbilityTreeTitles[1]="修验道"
AbilityTreeTitles[2]="浪人"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="剑圣"
+RandomNickNames[1]="浪人"
+RandomNickNames[2]="将军"
+RandomNickNames[3]="斩"
+RandomNickNames[4]="樱花"
+RandomNickNames[5]="木剑"
+RandomNickNames[6]="禅"
+RandomNickNames[7]="利刃"
+RandomNickNames[8]="山岚"
+RandomNickNames[9]="暴雨"
+RandomNickNames[10]="云舞"
+RandomNickNames[11]="割草"
+RandomNickNames[12]="荣耀"
+RandomNickNames[13]="死伴"
+RandomNickNames[14]="追猎者"
+RandomNickNames[14]="武士道"

[SamuraiTacticalRigging X2AbilityTemplate]
LocFriendlyName="当世具足"
LocLongDescription="若士兵护甲没提供通用物品槽位，则额外增加一个通用物品槽位。"
LocHelpText="若士兵护甲没提供通用物品槽位，则额外增加一个通用物品槽位。"
LocFlyOverText="当世具足" 
LocPromotionPopupText="<Bullet/>允许该士兵额外装备一种榴弹、弹药或是防弹背心，增加其作战能力。<br/><Bullet/>换皮版<font color='#0bff9b'>战术装配</font>。"

[HawkEye X2AbilityTemplate]
LocFriendlyName="鹰隼锐目"
LocLongDescription="犹长老所言，战阵之间，毙一敌犹鹰搏雀也，虽混迹于千人之中，亦必矢志不移，紧锁其踪。<br/>使<Ability:ClassName/>近战攻击提高<font color='#0bff9b'>15%</font>的暴击率以及<font color='#0bff9b'>3</font>点暴击伤害。"
LocHelpText="犹长老所言，战阵之间，毙一敌犹鹰搏雀也，虽混迹于千人之中，亦必矢志不移，紧锁其踪。<br/>使<Ability:ClassName/>近战攻击提高<font color='#0bff9b'>15%</font>的暴击率以及<font color='#0bff9b'>3</font>点暴击伤害。"
LocFlyOverText="鹰隼锐目" 
LocPromotionPopupText="<Bullet/><Ability:ClassName/>近战攻击提高<font color='#0bff9b'>15%</font>的暴击率以及<font color='#0bff9b'>3</font>点暴击伤害。"

[WayOfTheSamurai X2AbilityTemplate]
LocFriendlyName="武侍道途"
LocLongDescription="吾辈武侍，道在生死之间，每日冥想，皆须抱必死之心，方能悟其真谛。<br/>使<Ability:ClassName/>近战武器提高<font color='#0bff9b'>15</font>点命中以及<font color='#0bff9b'>3</font>点伤害。"
LocHelpText="吾辈武侍，道在生死之间，每日冥想，皆须抱必死之心，方能悟其真谛。<br/>使<Ability:ClassName/>近战武器提高<font color='#0bff9b'>15</font>点命中以及<font color='#0bff9b'>3</font>点伤害。"
LocFlyOverText="武侍道途" 
LocPromotionPopupText="<Bullet/><Ability:ClassName/>近战武器提高<font color='#0bff9b'>15</font>点命中以及<font color='#0bff9b'>3</font>点伤害。"

[Unstoppable X2AbilityTemplate]
LocFriendlyName="势不可挡"
LocLongDescription="古人云，三思而后行，七息定乾坤。<br/>使<Ability:ClassName/>近战攻击无视目标<font color='#0bff9b'>闪避</font>造成伤害。"
LocHelpText="古人云，三思而后行，七息定乾坤。<br/>使<Ability:ClassName/>近战攻击无视目标<font color='#0bff9b'>闪避</font>造成伤害。"
LocFlyOverText="势不可挡" 
LocPromotionPopupText="<Bullet/><Ability:ClassName/>近战攻击无视目标<font color='#0bff9b'>闪避</font>造成伤害。"

[MeleeShredder X2AbilityTemplate]
LocFriendlyName="气势如虹"
LocLongDescription="使<Ability:ClassName/>近战武器可撕碎护甲，根据科技等级分别为<font color='#0bff9b'>1</font>(<font color='#FFECEC'>传统</font>)/<font color='#0bff9b'>1</font>(<font color='#DA0F0F'>激光</font>)/<font color='#0bff9b'>2</font>(<font color='#27AAE1'>磁力</font>)/<font color='#0bff9b'>2</font>(<font color='#00EC00'>线圈</font>)/<font color='#0bff9b'>3</font>(<font color='#AB35D2'>电浆</font>)点碎甲。"
LocHelpText="使<Ability:ClassName/>近战武器可撕碎护甲，根据科技等级分别为<font color='#0bff9b'>1</font>(<font color='#FFECEC'>传统</font>)/<font color='#0bff9b'>1</font>(<font color='#DA0F0F'>激光</font>)/<font color='#0bff9b'>2</font>(<font color='#27AAE1'>磁力</font>)/<font color='#0bff9b'>2</font>(<font color='#00EC00'>线圈</font>)/<font color='#0bff9b'>3</font>(<font color='#AB35D2'>电浆</font>)点碎甲。""
LocFlyOverText="气势如虹" 
LocPromotionPopupText="<Bullet/><font color='#FFECEC'>传统</font>与<font color='#DA0F0F'>激光</font>等级近战武器提供<font color='#0bff9b'>1</font>点碎甲。<br/><Bullet/><font color='#27AAE1'>磁力</font>与<font color='#00EC00'>线圈</font>等级近战武器提供<font color='#0bff9b'>2</font>点碎甲。<br/><Bullet/><font color='#AB35D2'>电浆</font>等级近战武器提供<font color='#0bff9b'>3</font>点碎甲。"

[TrainingDiscipline X2AbilityTemplate]
LocFriendlyName="无尽武炼"
LocLongDescription="<i>夫真力者，智慧之花也；而花之种，则行动力也。<i/><br/>使<Ability:ClassName/>提高<font color='#0bff9b'>3</font>点移动力以及<font color='#0bff9b'>20</font>点闪避。"
LocHelpText="<i>夫真力者，智慧之花也；而花之种，则行动力也。<i/><br/>使<Ability:ClassName/>提高<font color='#0bff9b'>3</font>点移动力以及<font color='#0bff9b'>20</font>点闪避。"
LocFlyOverText="无尽武炼" 
LocPromotionPopupText="<Bullet>提高<font color='#0bff9b'>3</font>点移动力以及<font color='#0bff9b'>20</font>点闪避。"

[Yamabushi X2AbilityTemplate]
LocFriendlyName="山伏秘传"
LocLongDescription="<i>山伏门徒，以绝欲为基，修心炼性，冀获精神之升腾，神秘之力量，乃至超自然之境界也。<i/><br/>使<Ability:ClassName/>提高<font color='#0bff9b'>1</font>点<font color='#ffcd28'>护甲</font>以及<font color='#0bff9b'>15</font>点防御；当受伤时，每回合可恢复<font color='#0bff9b'>2</font>点生命，至多恢复<font color='#0bff9b'>6</font>点生命。"
LocHelpText="<i>山伏门徒，以绝欲为基，修心炼性，冀获精神之升腾，神秘之力量，乃至超自然之境界也。<i/><br/>使<Ability:ClassName/>提高<font color='#0bff9b'>1</font>点<font color='#ffcd28'>护甲</font>以及<font color='#0bff9b'>15</font>点防御；当受伤时，每回合可恢复<font color='#0bff9b'>2</font>点生命，至多恢复<font color='#0bff9b'>6</font>点生命。"
LocFlyOverText="山伏秘传" 
LocPromotionPopupText="<Bullet>提高<font color='#0bff9b'>1</font>点<font color='#ffcd28'>护甲</font>以及<font color='#0bff9b'>15</font>点防御。<br/><Bullet/>当受伤时，每回合可恢复<font color='#0bff9b'>2</font>点生命。<br/><Bullet/><font color='#ff3206'>注意</font>：至多恢复<font color='#0bff9b'>6</font>点生命。"

[DangerSense X2AbilityTemplate]
LocFriendlyName="凶兆直感"
LocLongDescription="当处外也，宜慎其行，而心常宁，神必清，且备不虞。<i/><br/>使<Ability:ClassName/>即使没有视线，也能探测到附近<font color='#0bff9b'>20</font>格范围的单位。"
LocHelpText="当处外也，宜慎其行，而心常宁，神必清，且备不虞。<i/><br/>使<Ability:ClassName/>即使没有视线，也能探测到附近<font color='#0bff9b'>20</font>格范围的单位。"
LocFlyOverText="凶兆直感"
LocPromotionPopupText="<Bullet/>可检测墙壁背后和其他视线盲区。<br/><Bullet/>凶兆直感能够探测到<font color='#0bff9b'>20</font>格范围内的敌人。<br/><Bullet/>检测到的单位将显示为可视轮廓。<br/><Bullet/>单位将一直保持揭示状态直到玩家回合结束。如果此时它们超出跟踪的范围，则不再被检测到。"

[SamuraiFrenzy X2AbilityTemplate]
LocFriendlyName="抬榇死战"
LocLongDescription="虽猝斩首，犹能一奋。勇夫之气，愤于死鬼，其决烈之状，虽首断而犹不死也。<br/>当<Ability:ClassName/>受到伤害时，进入<font color='#FA7190'>抬榇死战</font>状态。立刻获得<font color='#5ac864'>1</font>行动点，并在持续时间内提高<font color='#0bff9b'>50%</font>的暴击率以及<font color='#0bff9b'>80</font>点闪避。<br/>持续时间：<font color='#0bff9b'>2</font>回合"
LocHelpText="虽猝斩首，犹能一奋。勇夫之气，愤于死鬼，其决烈之状，虽首断而犹不死也。<br/>当<Ability:ClassName/>受到伤害时，进入<font color='#FA7190'>抬榇死战</font>状态。立刻获得<font color='#5ac864'>1</font>行动点，并在持续时间内提高<font color='#0bff9b'>50%</font>的暴击率以及<font color='#0bff9b'>80</font>点闪避。<br/>持续时间：<font color='#0bff9b'>2</font>回合"
LocFlyOverText="抬榇死战"
LocPromotionPopupText="<Bullet/>当受到伤害时，进入<font color='#FA7190'>抬榇死战</font>状态。<br/><Bullet/><font color='#FA7190'>抬榇死战</font>：立刻获得<font color='5ac864'>1</font>行动点，并在持续时间内提高<font color='#0bff9b'>50%</font>的暴击率以及<font color='#0bff9b'>80</font>点闪避。<br/><Bullet/>持续时间：<font color='#0bff9b'>2</font>回合"

[SamuraiCoupDeGrace X2AbilityTemplate]
LocFriendlyName="恩赐解脱"
LocFlyOverText="恩赐解脱"
LocLongDescription="当<Ability:ClassName/>使用近战武器攻击陷入混乱、眩晕、恐慌状态的敌人时，提高<font color='#0bff9b'>50</font>点命中、<font color='#0bff9b'>50%</font>的暴击率以及<font color='#0bff9b'>2</font>点伤害。"
LocHelpText="当<Ability:ClassName/>使用近战武器攻击陷入混乱、眩晕、恐慌状态的敌人时，提高<font color='#0bff9b'>50</font>点命中、<font color='#0bff9b'>50%</font>的暴击率以及<font color='#0bff9b'>2</font>点伤害。"
LocPromotionPopupText="<Bullet/>恩赐解脱对陷入眩晕、恐慌状态的敌人提高<font color='#0bff9b'>50</font>点命中、<font color='#0bff9b'>50%</font>的暴击率以及<font color='#0bff9b'>2</font>点伤害。<br/><Bullet/>恩赐解脱对陷入混乱状态的敌人提高<font color='#0bff9b'>25</font>点命中、<font color='#0bff9b'>25%</font>的暴击率以及<font color='#0bff9b'>1</font>点伤害。"

[SamuraiCutthroat X2AbilityTemplate]
LocFriendlyName="杀生斩业"
LocFlyOverText="杀生斩业"
LocLongDescription="使<Ability:ClassName/>近战攻击无视生物单位<font color='#ffcd28'>护甲</font>造成伤害。并额外提高<font color='#0bff9b'>15%</font>的暴击率以及<font color='#0bff9b'>2</font>点暴击伤害。"
LocHelpText="使<Ability:ClassName/>近战攻击无视生物单位<font color='#ffcd28'>护甲</font>造成伤害。并额外提高<font color='#0bff9b'>15%</font>的暴击率以及<font color='#0bff9b'>2</font>点暴击伤害。"
LocPromotionPopupText="<Bullet/>近战攻击无视生物单位<font color='#ffcd28'>护甲</font>造成伤害。<br/><Bullet/>提高<font color='#0bff9b'>15%</font>的暴击率以及<font color='#0bff9b'>2</font>点暴击伤害。"

[MZBladeGrasp X2AbilityTemplate]
+LocFriendlyName="人剑合一"
+LocLongDescription="<Ability:ClassName/>对<Ability:WeaponName/>的掌握以到达至臻境，可<font color='#0bff9b'>规避</font>来袭的攻击，<font color='#0bff9b'>规避</font>概率等同自身当前<font color='#b4b6dc'>意志</font>。"
+LocHelpText="<Ability:ClassName/>对<Ability:WeaponName/>的掌握以到达至臻境，可<font color='#0bff9b'>规避</font>来袭的攻击，<font color='#0bff9b'>规避</font>概率等同自身当前<font color='#b4b6dc'>意志</font>。"
+LocFlyOverText="人剑合一"
+LocPromotionPopupText="<Bullet/><font color='#0bff9b'>规避</font>概率等同自身当前<font color='#b4b6dc'>意志</font>。<br/><Bullet/><font color='#ff3206'>注意</font>：无法闪躲范围攻击。"

[MZSweepingSpin X2AbilityTemplate]
+LocFriendlyName="天翔龙闪"
+LocLongDescription="指定<font color='#0bff9b'><Ability:SweepingSpinRadius/></font>米半径的区域，并化身旋风无情地扫荡其中之敌并对其造成伤害。<br/>冷却时间：<font color='#0bff9b'>3</font>回合"
+LocHelpText="指定<font color='#0bff9b'><Ability:SweepingSpinRadius/></font>米半径的区域，并化身旋风无情地扫荡其中之敌并对其造成伤害。<br/>冷却时间：<font color='#0bff9b'>3</font>回合"
+LocFlyOverText="天翔龙闪"
+LocPromotionPopupText="<Bullet/><font color='#ff3206'>注意</font>：因兼容问题，部分伤害加成无法作用该技能。<br/><Bullet/>冷却时间：<font color='#0bff9b'>3</font>回合"

;-------------------------------------------------------------------------------------分割线-------------------------------------------------------------------------------------
;武士MOD在LWOTC环境下会导致无法获取专注，因此相关技能在技能池里移除，不做精翻

[Shinigami X2AbilityTemplate]
LocFriendlyName="死神·武士"
LocLongDescription="\"今天我成为死神\"我们的科学家不完全确定为何武士要比我们的普通士兵杀人更快。他们说这是因为一种灵能能力，可以吸收被他击杀的敌人能量。武士在近战中每杀一人，他就获得一个专注点。激活后，你的近战攻击不会结束回合。激活将消耗2个专注。"
LocHelpText="他们说这是一种灵能能力，可以吸收被他击杀的敌人能量。武士在近战中每杀一人，他就获得一个专注点。激活后，你的近战攻击不会结束回合。激活将消耗2个专注。"
LocFlyOverText="死神·武士"
LocPromotionPopupText="<Bullet/>他们说这是一种灵能能力，可以吸收被他击杀的敌人能量。武士在近战中每杀一人，他就获得一个专注点。激活后，你的近战攻击不会结束回合。激活将消耗2个专注。<br/><Bullet/>每收集10个灵魂，你就获得+1暴击率，每20个灵魂+1暴击伤害。<br/>"

[SamuraiSoulSteal X2AbilityTemplate]
LocFriendlyName="死神·灵魂窃取"
LocLongDescription="\"今天我成为死神\"我们的科学家不完全确定为何武士要比我们的普通士兵杀人更快。他们说这是因为一种灵能能力，可以吸收被他击杀的敌人能量。武士在近战中每杀一人，他就获得一个专注点。激活后，你的近战攻击不会结束回合。激活将消耗2个专注。"
LocHelpText="他们说这是一种灵能能力，可以吸收被他击杀的敌人能量。武士在近战中每杀一人，他就获得一个专注点。激活后，你的近战攻击不会结束回合。激活将消耗2个专注。"
LocFlyOverText="死神·灵魂窃取"
LocPromotionPopupText="<Bullet/>他们说这是一种灵能能力，可以吸收被他击杀的敌人能量。武士在近战中每杀一人，他就获得一个专注点。激活后，你的近战攻击不会结束回合。激活将消耗2个专注。<br/><Bullet/>每收集10个灵魂，你就获得+1暴击率，每20个灵魂+1暴击伤害。<br/>"

[SamuraiSoulStealConsumeSoul X2AbilityTemplate]
LocFriendlyName="死神·吞噬灵魂"
LocLongDescription="\"今天我成为死神\"我们的科学家不完全确定为何武士要比我们的普通士兵杀人更快。他们说这是因为一种灵能能力，可以吸收被他击杀的敌人能量。武士在近战中每杀一人，他就获得一个专注点。激活后，你的近战攻击不会结束回合。激活将消耗2个专注。"
LocHelpText="他们说这是一种灵能能力，可以吸收被他击杀的敌人能量。武士在近战中每杀一人，他就获得一个专注点。激活后，你的近战攻击不会结束回合。激活将消耗2个专注。"
LocFlyOverText="死神·吞噬灵魂"
LocPromotionPopupText="<Bullet/>他们说这是一种灵能能力，可以吸收被他击杀的敌人能量。武士在近战中每杀一人，他就获得一个专注点。激活后，你的近战攻击不会结束回合。激活将消耗2个专注。<br/><Bullet/>每收集10个灵魂，你就获得+1暴击率，每20个灵魂+1暴击伤害。<br/>"

[WhirlwindStrike X2AbilityTemplate]
LocFriendlyName="旋风斩"
LocLongDescription="武士之道其一是疾如风，最好就是急速向前冲刺。<br/>向目标执行两次斩击。每次都有-15命中惩罚。<br/>无冷却时间。<br/>消耗1个专注点。"
LocHelpText="向目标执行两次斩击。每次都有-15命中惩罚。<br/>消耗1个专注点。"
LocFlyOverText="向目标执行两每次都有-15命中惩罚。<br/>消耗1个专注点。" 
LocPromotionPopupText="<Bullet/>次斩击。向目标执行两次斩击。每次都有-15命中惩罚。<br/><Bullet/>无冷却时间。<br/><Bullet/>消耗1个专注点。"

[WhirlwindFirstStrike X2AbilityTemplate]
LocFriendlyName="旋风斩"
LocLongDescription="武士之道其一是疾如风，最好就是急速向前冲刺。<br/>向目标执行两次斩击。每次都有-15命中惩罚。<br/>无冷却时间。<br/>消耗1个专注点。"
LocHelpText="向目标执行两次斩击。每次都有-15命中惩罚。<br/>消耗1个专注点。"
LocFlyOverText="向目标执行两次斩击。每次都有-15命中惩罚。<br/>消耗1个专注点。" 
LocPromotionPopupText="<Bullet/>向目标执行两次斩击。每次都有-15命中惩罚。<br/><Bullet/>无冷却时间。<br/><Bullet/>消耗1个专注点。"

[DragonStrike X2AbilityTemplate]
LocFriendlyName="飞龙斩"
LocLongDescription="理性无法决断；剑会决断！向敌人发起可怕的攻击，造成巨大伤害并使幸存者混乱。消耗1个专注点。"
LocHelpText="向敌人发起可怕的攻击，造成范围伤害并使幸存者混乱。消耗1个专注点。"
LocFlyOverText="飞龙斩" 
LocPromotionPopupText="<Bullet>近战攻击5格半径范围<br/><Bullet/><Ability:SelfCooldown/> 冷却时间<br/><Bullet/>消耗1个专注点。"

[SwordThrust X2AbilityTemplate]
LocFriendlyName="剑刺"
LocFlyOverText="剑刺"
LocLongDescription="特殊的近战攻击，穿透大部分盔甲并造成目标破甲。消耗1专注点。"
LocHelpText="特殊的近战攻击，穿透大部分盔甲并造成目标破甲。消耗1专注点。"
LocPromotionPopupText="<Bullet/>+5穿甲<br/><Bullet/>+4破甲<br/><Bullet/>3回合冷却<br/><Bullet/>消耗1专注点。"